КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПодразделенияДиадок/КонтурЛогистика_ПодразделенияДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ПодразделенияДиадок</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ID</name>
    <comment>Идентификатор подразделения Диадок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDВладелец</name>
    <comment>связь с организациями по КонтурЛогистика_ОрганизацииДиадок.OrgId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDОсновное</name>
    <comment>Идентификатор основного подразделения Диадок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРодитель</name>
    <comment>Идентификатор родительского подразделения Диадок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>43</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресApartment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресBlock</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресBuilding</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресCity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресLocality</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресRegion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресStreet</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресTerritory</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресZipCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКодГАР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГАРЗначение</name>
    <comment>JSON структуры адреса ФИАС/ГАР для исходящего XDTO</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <comment>Текстовое представления адреса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнАдресAddress</name>
    <comment>Адрес иностранного подразделения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнАдресCountry</name>
    <comment>Страна иностранного подразделения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключено</name>
    <comment>Признак IsDisabled в Диадок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Подразделение</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПодразделенияДиадок/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетВыборАдресаИзСписка;

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_ПодразделенияДиадок", ЭтаФорма, Элементы.Группа1);
		
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если ЗначениеЗаполнено(Объект.IDВладелец) Тогда 
		ОрганизацияДиадок = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("OrgId", Объект.IDВладелец);
	КонецЕсли;
	
	ИнициализироватьАдресНаФорме();
	
КонецПроцедуры

// +++ КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
  КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

// --- КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
			
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	НаправлениеКонвертации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
	ИмяТипаСправочника = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура("НаправлениеКонвертации, ТипСправочникаЛогистика", НаправлениеКонвертации, ИмяТипаСправочника); 
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"СоздатьНаОснованииНачалоВыбораЗавершение", Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьНаОснованииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Сообщить("Не выбрана настройка конвертации справочника");
		Возврат;
	КонецЕсли;
	
	НастройкаКонвертацииСправочника = Результат;
	КонтурЛогистика_КонвертацияКлиент.КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(ЭтаФорма, НастройкаКонвертацииСправочника);
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;

КонецПроцедуры

#Область ВводАдреса

&НаСервере
Процедура ИнициализироватьАдресНаФорме()
	
	КонтурЛогистика_ВводАдреса.ПодготовитьОтображениеАдресаПодразделенияДиадок(Объект);
	АдресСтрокаВвод = КонтурЛогистика_ВводАдреса.ТекстАдресаДляОтображенияПодразделенияДиадок(Объект);
	АдресКодГАРВвод = Объект.АдресКодГАР;
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоАдресРоссииНаСервере(Знач ИнАдресCountry)
	
	Возврат КонтурЛогистика_ВводАдреса.ЭтоСтранаРоссияПодразделенияДиадок(ИнАдресCountry);
	
КонецФункции

&НаКлиенте
Процедура ИнАдресCountryПриИзменении(Элемент)
	
	ПриИзмененииСтраныАдресаНаСервере(АдресСтрокаВвод);
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ИдетВыборАдресаИзСписка = Ложь;
	
	Если Не ЭтоАдресРоссииНаСервере(Объект.ИнАдресCountry) Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьПодсказкиАдреса(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСтрокаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ИдетВыборАдресаИзСписка = Истина;
	Попытка
		АдресСтрокаВвод = ВыбранноеЗначение.Подсказка;
		Если ВыбранноеЗначение.Свойство("ЭтоСвободнаяФорма")
			И ВыбранноеЗначение.ЭтоСвободнаяФорма Тогда
			АдресКодГАРВвод = "";
			ПрименитьТекстАдресаНаСервере(ВыбранноеЗначение.Подсказка);
		Иначе
			ПрименитьПодсказкуАдресаНаСервере(ВыбранноеЗначение.ИдентификаторФИАС, ВыбранноеЗначение.Подсказка);
		КонецЕсли;
	Исключение
		ИдетВыборАдресаИзСписка = Ложь;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСтрокаПриИзменении(Элемент)
	
	Если ИдетВыборАдресаИзСписка = Истина Тогда
		ИдетВыборАдресаИзСписка = Ложь;
		Возврат;
	КонецЕсли;
	
	АдресКодГАРВвод = "";
	Элементы.ДекорацияТипАдреса.Заголовок = "";
	ПрименитьТекстАдресаНаСервере(АдресСтрокаВвод);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПодсказкиАдреса(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ТекстПоиска = СокрЛП(Текст);
	Если СтрДлина(ТекстПоиска) < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Подсказки = ПодсказкиАдресаНаСервере(ТекстПоиска);
	Если Подсказки = Неопределено Тогда
		ДобавитьВыборСвободнойФормыАдреса(ДанныеВыбора, ТекстПоиска);
		Возврат;
	КонецЕсли;
	
	Для Каждого Подсказка Из Подсказки Цикл
		
		Если Подсказка.Свойство("ЭтоСвободнаяФорма")
			И Подсказка.ЭтоСвободнаяФорма Тогда
			ДанныеВыбора.Добавить(Подсказка, Подсказка.ПредставлениеВыбора);
			Продолжить;
		КонецЕсли;
		
		Представление = Подсказка.Подсказка;
		Если Не ЗначениеЗаполнено(Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Подсказка, Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыборСвободнойФормыАдреса(ДанныеВыбора, Знач ТекстПоиска)
	
	ВыборСвободнойФормы = Новый Структура;
	ВыборСвободнойФормы.Вставить("Подсказка", ТекстПоиска);
	ВыборСвободнойФормы.Вставить("ИдентификаторФИАС", "");
	ВыборСвободнойФормы.Вставить("УровеньФИАС", "");
	ВыборСвободнойФормы.Вставить("ЭтоСвободнаяФорма", Истина);
	ДанныеВыбора.Добавить(ВыборСвободнойФормы, "<добавить в свободной форме>");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтраныАдресаНаСервере(Знач ТекстАдреса)
	
	АдресКодГАРВвод = "";
	СброситьКодГАРАдресаНаСервере();
	
	Если КонтурЛогистика_ВводАдреса.ЭтоСтранаРоссияПодразделенияДиадок(Объект.ИнАдресCountry) Тогда
		Объект.ИнАдресAddress = "";
	Иначе
		КонтурЛогистика_ВводАдреса.ПрименитьИностранныйАдресПодразделенияДиадок(Объект, ТекстАдреса);
		АдресСтрокаВвод = Объект.ИнАдресAddress;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьКодГАРАдресаНаСервере()
	
	Объект.АдресКодГАР = "";
	Объект.АдресГАРЗначение = "";
	КонтурЛогистика_ВводАдреса.ОчиститьАдресКЛАДРПодразделенияДиадок(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьТекстАдресаНаСервере(Знач ТекстАдреса)
	
	Если ЗначениеЗаполнено(АдресКодГАРВвод) Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ВводАдреса.ПрименитьРучнойТекстАдресаПодразделенияДиадок(Объект, ТекстАдреса);
	АдресСтрокаВвод = Объект.ИнАдресAddress;
	АдресКодГАРВвод = Объект.АдресКодГАР;
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПодсказкуАдресаНаСервере(Знач ИдентификаторФИАС, Знач Представление)
	
	КонтурЛогистика_ВводАдреса.ПрименитьАдресИзПодсказкиФИАСКПодразделениюДиадок(
		Объект, ИдентификаторФИАС, Представление);
	АдресСтрокаВвод = Объект.ИнАдресAddress;
	АдресКодГАРВвод = Объект.АдресКодГАР;
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодсказкиАдресаНаСервере(Знач Текст)
	
	Попытка
		Клиент = КонтурЛогистика_ВводАдреса.НовыйФиасКлиент("", КонтурЛогистика_ВводАдреса.ЛокацияФиасПоУмолчанию());
		Возврат КонтурЛогистика_ВводАдреса.ПодсказкиАдреса(Клиент, Текст);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформативнуюНадписьАдреса()
	
	ТипАдреса = КонтурЛогистика_ВводАдреса.ОпределитьТипАдресаПодразделенияДиадок(Объект);
	Элементы.ДекорацияТипАдреса.Заголовок =
		КонтурЛогистика_ВводАдреса.ЗаголовокИнформацииТипаАдресаОрганизации(ТипАдреса);
	
КонецПроцедуры

#КонецОбласти
